app/views/users/show.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]
---
<ul>
  <% @user.projects.each do |project|%>