app/controllers/users_controller.rb

UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "roz@mail.com"], ["updated_at", "2016-01-02 06:25:46.893449"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)